[
  {
    "issueId": "housing",
    "title": "Housing",
    "paragraphs": [
      "Everyone deserves a safe, affordable place to call home, but right now too many families in Savannah are struggling. Rent and home prices are skyrocketing. Wages aren’t keeping up, and hardworking people are being priced out of their own communities.",
      "Without affordable housing, parents are forced to choose between paying rent and putting food on the table. Kids grow up in overcrowded homes, falling behind in school because they don’t have a safe, stable place to study. Seniors on fixed incomes are being pushed out of neighborhoods they’ve lived in for decades. And when families can’t afford decent housing, they end up in dangerous conditions: mold making them sick, pests crawling through the walls, lead poisoning their children. This is unacceptable. This isn’t just a housing crisis, it’s a threat to our health, our kids, and our future.",
      "We need bold action now. We need to build more truly affordable housing—not just luxury apartments for the rich. We need to protect tenants from greedy landlords, and make sure no family has to spend half their paycheck just to keep a roof over their heads. Because a home isn’t just four walls. It’s security, it’s dignity, and it’s the foundation of a better life. Together, we can take back our neighborhoods and make sure that in Georgia housing is a right, not a privilege."
    ],
    "proposals": [
      "Allow cities to enact rent control policies to combat skyrocketing housing costs.",
      "End no-cause evictions and impose stricter penalties for predatory landlords.",
      "Invest in high-quality, state-funded affordable housing with long-term stability for families.",
      "Create stronger regulations to keep our housing livable, clean, and safe.",
      "Make it easier to rent by reducing income requirements to qualify for an apartment, ending application fees, and limiting security deposits.",
      "Prevent private equity firms and exploitive businesses from buying up homes.",
      "Give renters a seven-day curing period if they are late on rent.",
      "Support land trusts, co-ops, flexible zoning, and audit housing programs for equity and access.",
      "Require community benefit agreements and stop public land giveaways without inclusive input.",
      "Ensure ADA-compliant housing and infrastructure to support disabled residents."
    ]
  },
  {
    "issueId": "healthcare",
    "title": "Healthcare",
    "paragraphs": [
      "Georgia’s healthcare system is broken and rigged by corporate greed, leaving working families to suffer while hospitals close and medical bills bankrupt the poor. Millions are uninsured, Black mothers die at alarming rates, and rural communities are left with nowhere to turn. Enough is enough. We need Medicaid expansion NOW, a moratorium on hospital closures, and a public healthcare guarantee that puts people over profits.",
      "We also need to work towards creating universal healthcare for all. No more letting insurance companies dictate who lives and who struggles. It’s time to tax the rich, fund clinics in every community, slash drug prices, and pay healthcare workers what they’re worth. Healthcare is a human right, not a luxury and I’ll fight like hell to make sure every Georgian gets the care they deserve."
    ],
    "proposals": [
      "Expand Medicaid fully to accept federal funds to provide healthcare to 500,000+ uninsured Georgians.",
      "Lower prescription drug costs, cap insulin prices and allow the state to negotiate drug prices to reduce burdens on families.",
      "Explore state-level solutions to guarantee affordable, universal healthcare access.",
      "Improve the current Pathways to Coverage program.",
      "Adopt continuous Medicaid and PeachCare eligibility for children from birth through kindergarten.",
      "Update Georgia’s public benefit eligibility and enrollment infrastructure.",
      "Ensure equitable pay for frontline healthcare workers.",
      "Expand access to supportive housing for Georgians with serious and persistent mental illness by increasing funds for the Georgia Housing Voucher Program.",
      "Expand funding for public mental health and addiction services."
    ]
  },
  {
    "issueId": "economy",
    "title": "Economy",
    "paragraphs": [
      "Georgia is ranked one of the best states to have a business, but for workers, it is ranked among the worst. While corporations get tax breaks and billionaires amass fortunes, hardworking Georgians face stagnant wages, brutal work hours, and union suppression. This isn't right. We need an economic revolution that puts workers first.",
      "We need a Georgia where no full-time worker lives in poverty. That means raising the minimum wage, repealing anti-union 'right-to-work' laws, and guaranteeing paid leave, fair schedules, and strong worker protections. It means ensuring affordable, quality childcare for working families. We need a Georgia where small businesses and worker cooperatives thrive instead of corporate monopolies. A Georgia where the ultra-rich finally pay their fair share to fund schools, healthcare, and infrastructure for all.",
      "The choice is clear: endless greed for the few, or dignity and fair wages for the many. Together, we'll build an economy that puts people over profits, always."
    ],
    "proposals": [
      "Expand workers rights to include raising the minimum wage, guaranteed paid leave, and protecting collective bargaining rights.",
      "Repeal Georgia's anti-union 'right-to-work' laws.",
      "Strengthen penalties for employers who withhold wages and establish a state enforcement division.",
      "Create penalties for insurance companies who deny workers compensation claims without cause.",
      "Ensure gig workers (e.g., Uber drivers) receive minimum wage, benefits, and worker classification as employees if they meet certain criteria.",
      "Require employers to be transparent about compensation and promotional opportunities in job postings and internal notices, including banning ghost job postings.",
      "Close corporate loopholes and ensure the wealthiest pay their fair share to fund schools, healthcare, and infrastructure.",
      "Tax the wealthiest 1% so they pay their fair share with a more progressive state income tax.",
      "Offer tax credits for small businesses that provide livable wages, healthcare, or worker training.",
      "Expand low-interest loan programs and microlending for small businesses, particularly minority- and women-owned firms.",
      "End work requirements for essential benefits (disability, healthcare, SNAP, etc).",
      "Improve broadband and transportation to help small businesses thrive in rural areas.",
      "Expand subsidies for childcare to help workers and reduce costs for small business employees."
    ]
  },
  {
    "issueId": "education",
    "title": "Education",
    "paragraphs": [
      "Our schools are the backbone of our communities. They shape our children’s futures, create pathways to opportunity, and bring neighbors together. Yet right now, they’re under attack. While politicians hand out tax breaks to corporations and the wealthy, Georgia’s children are being left behind. We rank 38th in education!",
      "Too many kids sit in crumbling classrooms with outdated textbooks, while teachers dig into their own pockets just to afford school supplies. In wealthy districts, students thrive, but in poor and working-class communities, underfunded schools trap generations in a cycle of poverty. Enough is enough. We must fully fund our schools, pay teachers like the professionals they are, and guarantee every child, no matter their race, zip code, or family income, a world-class education.",
      "The future of Georgia depends on it. If we don’t fight for our kids now, who will."
    ],
    "proposals": [
      "Fully fund our public schools and reverse privatization schemes and ensure every school has the resources to succeed.",
      "Cancel student lunch debt and provide universal free school meals because no child should go hungry.",
      "Fully fund and expand Georgia’s HOPE Grant to cover the rising cost of college education.",
      "Increase pay for teachers and support staff in our schools."
    ]
  },
  {
    "issueId": "environmental",
    "title": "Environmental",
    "paragraphs": [
      "Coastal Georgia is on the front lines of climate change and the stakes couldn’t be higher. Rising seas are swallowing shorelines, hotter temperatures are fueling stronger storms, and salty ocean water is creeping into our freshwater wetlands, threatening wildlife and livelihoods alike.",
      "Iconic spots like River Street and Tybee Island aren’t just postcard-perfect escapes; they’re economic powerhouses that fishing, tourism, and a way of life that could vanish if we don’t act. Like many of you I’ve had to spend more time preparing for hurricane season. I’ve experienced longer power outages after storms, and seen many of our streets flood after heavy rains. But here’s the good news: We can still protect what makes this place special.",
      "By taking smart steps like strengthening our infrastructure, restoring natural buffers, and cutting emissions, we can keep our communities resilient and thriving for generations. This isn’t just about saving marshes or protecting sea turtles (though that matters too); it’s about safeguarding homes, jobs, and the very soul of Georgia’s coast. The time to act is now because once these treasures are lost, they’re gone for good. The question isn’t whether we can afford to take action, it’s whether we can afford not to."
    ],
    "proposals": [
      "Transition Georgia to 100% renewable energy while creating unionized, high-paying jobs.",
      "Tax corporate polluters to fund clean air and water initiatives, especially in marginalized communities.",
      "Invest in statewide rail and bus systems to reduce emissions and connect workers to jobs.",
      "Require all new and expanding data centers to use 100% renewable energy, meet strict energy standards, and offset their water consumption."
    ]
  },
  {
    "issueId": "public-safety",
    "title": "Public Safety",
    "paragraphs": [
      "Georgia's criminal justice system is broken and it's destroying lives. We lock up more of our people than any other state, wasting billions to cage human beings instead of healing communities. And who does this system really serve? Not working families. Not survivors of crime. Not the thousands trapped in cycles of addiction and mental health crises who are punished instead of treated. And after someone has served their time? A criminal record becomes a life sentence. It blocks access to jobs, housing, and any chance at a fresh start.",
      "For seven years, I worked directly with those caught in this cruel system. I'll never forget the young woman in my office, crying, telling me she’d die if she couldn’t get help, only to hear every treatment center say, 'We’re full' or 'You can’t afford it.' I’ve seen judges more concerned with maintaining their conviction rates than delivering justice. I’ve watched police abuse their authority without consequence. And I’ve witnessed, over and over, how wealth and connections buy freedom while the poor get crushed.",
      "Enough. Real safety doesn’t come from more cops and more cages. It comes from healthcare, education, and opportunity. Justice doesn’t mean vengeance. It means repairing harm and giving people a real chance to rebuild. I’ve seen what this system does firsthand. Now, I’m fighting to replace it with something that actually works for all Georgians."
    ],
    "proposals": [
      "End cash bail.",
      "Repeal local ordinances that criminalize the occupation of public spaces, particularly for people experiencing homelessness, such as statutes against loitering, panhandling, soliciting, camping, and sleeping.",
      "End all fines and fees associated with the criminal legal process, including ticketing, cash bail, court costs, and parole and probation fees.",
      "Establish an Independent Police Oversight Commission which is representative of the community and should also include the input of justice-involved individuals.",
      "Legalize marijuana and end the failed war on drugs.",
      "Pass common sense gun control laws such as background checks on all gun sales, ban assault weapons, reinstate waiting periods, secure storage laws, and mandatory safety training prior to purchasing a gun or carrying a gun in public.",
      "Increase certification requirements for law enforcement.",
      "Increase funding for mental health and substance abuse treatment."
    ]
  },
  {
    "issueId": "voting-rights",
    "title": "Voting Rights",
    "paragraphs": [
      "The right to vote is under attack in Georgia. Republican politicians are waging an all-out war on democracy by closing polling places, restricting absentee ballots, and creating hurdles to your vote. This is a blatant power grab by politicians who fear the voices of ordinary Georgians. As the late John Lewis taught us: 'The vote is precious, it is almost sacred. It is the most powerful nonviolent tool we have in a democratic society. And we have to use it.'",
      "This isn’t just about elections. It’s about power. Who will our government serve? The people, or just the wealthy and well-connected? We demand a democracy where every voice counts equally: one person, one vote; not one dollar, one vote. That means same-day registration, expanded early voting, and restoring voting rights to the formerly incarcerated.",
      "Georgia needs leaders who will battle voter suppression with unrelenting determination, not politicians who enable it. They want us to feel powerless—but when we organize, when we mobilize, when we vote? We are unstoppable. The future belongs to the people, and we will claim it together."
    ],
    "proposals": []
  },
  {
    "issueId": "civil-rights",
    "title": "Civil Rights",
    "paragraphs": [
      "For too long, the powerful have tried to divide us by race, gender, and identity. They perpetuate a system where Black communities are over-policed and underpaid, where women earn less for the same work, where LGBTQ+ people are targeted by fear, and where disabled voices are ignored. But their time is up.",
      "We are the rising tide of change. We are the movement that says no to bigotry and yes to a future where justice is not just a dream, but a promise we keep. We will fight for economic dignity, for racial equity, for bodily autonomy, and for a Georgia that works for all its people, not just the privileged few.",
      "Our unity is our strength, and together, we will win."
    ],
    "proposals": []
  }
]
